<template>
  <section class="container">
    <h2 class="main-article__header mb-15">Обо мне</h2>
    <div class="flex gap-x-15">
      <p class="main-article__paragraph">
        Художник-акварелист. Основная техника - акварель, жанр - пейзаж, сюжет -
        сельские и городские мотивы с архитектурой. Мне нравится рисовать на
        пленэре, делать наброски и быстрые этюды.
        <br />
        <br />

        Я работала в палехских мастерских «Духанин» и «Возрождение», в багетной
        мастерской, на росписях(сусальное золото), преподавала в художественной
        мастерской и также занималась росписью по дереву.
        <br />

        Участвую в рисовальных марафонах, конкурсах. Посещала Вечерние
        Рисовальные Классы при Академии художеств, мастер-классы акварелистов.
        <br />
        <br />

        В данный момент проживаю в Санкт-Петербурге, занимаюсь акварельной
        живописью, графикой, веду блог, пишу на заказ, провожу мастер-классы и
        преподаю в школе «Художник онлайн».
      </p>
      <img
        src="/about-hero.png"
        alt="Юлия Калашникова"
        class="main-article__picture h-100 w-auto object-cover rounded-lg"
      />
    </div>
  </section>
</template>

<script setup lang="ts"></script>

<style scoped></style>
